reddit_clone_2/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "erto"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by_username(username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "1bUVWFXA-S1D00t8zS7FyA"], ["updated_at", "2018-11-20 21:43:56.288950"], ["id", 5]]
---
  def reset_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!