reddit_clone_2/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "liz"], ["url", "liz.com"], ["content", "liz is my fav ta"], ["sub_id", 1], ["user_id", 1], ["created_at", "2018-11-21 01:09:32.327097"], ["updated_at", "2018-11-21 01:09:32.327097"]]