reddit_clone_2/app/views/subs/index.html.erb

SELECT "subs".* FROM "subs"
---
  <h1>All the Subs!</h1>
  <% Sub.all.each do |sub| %>